import os

# Токен бота
BOT_TOKEN = os.getenv("BOT_TOKEN", "8473743571:AAHU6sSYsiUx8rFTxpXeR6oVhAONnZ3HT60")

# ID администраторов
ADMIN_IDS = [int(os.getenv("ADMIN_ID", "599952947"))]  # Твой ID 599952947

# Уровни угрозы
THREAT_LEVELS = {
    1: {
        "name": "✅ Проверенный пользователь",
        "description": "Нареканий нет. Можно проводить сделки.",
        "emoji": "✅"
    },
    2: {
        "name": "⚠️ Требует осторожности",
        "description": "Есть жалобы. Используйте гаранта.",
        "emoji": "⚠️"
    },
    3: {
        "name": "🚨 Мошенник",
        "description": "Подтвержденный обман. Сделки запрещены!",
        "emoji": "🚨"
    }
}

# Контактные данные
ADMIN_CONTACTS = "@nemurovv / @F4ll3NAngel"
PROJECT_NAME = "TRUSTON"